/*

# কনকারেন্সি (Concurrency) ঃ  
    = কনকারেন্সি মূলত Time-slicing (Context Switching) এর মাধ্যমে কাজ করে। 
      একাধিক কাজ একই সময়ে শুরু হয়ে এবং (দেখে মনে হয় কাজগুলো) একই সময়ে শেষ হচ্ছে।
      আসলে এখানে শুধুমাত্র একটা প্রসেসর ব্যবহার হয়, আর প্রসেসর context switching এর মাধ্যমে একাধিক কাজ গুলো শেষ করে।

      যেমনঃ ওয়েব ব্রাউজারে একাধিক ট্যাব ওপেন করা।

    *** ডার্টে কনকারেন্সি হ্যান্ডেল করার জন্য Future এবং async/await ব্যবহার করা হয়। ***
  


# প্যারালেলিসম (Parallelism) ঃ
    = একাধিক কাজ একই সময়ে একাধিক প্রসেসর কোরে চলতে থাকে এবং এখানে কাজগুলো সত্যিকার অর্থে একই সময়ে সম্পন্ন হয়।
      প্যারালেলিজমের জন্য মাল্টি-কোর প্রসেসর প্রয়োজন।

      যেমনঃ ভিডিও রেন্ডারিং প্রক্রিয়া।

      *** ডার্টে প্যারালেলিজম হ্যান্ডেল করতে Isolates ব্যবহার করা হয়, যা একাধিক প্রসেসর কোরে কাজ করতে পারে। ***




 */ 